# 2.Напишите программу, которая найдёт произведение пар чисел списка. 
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
#Пример:
#[2, 3, 4, 5, 6] => [12, 15, 16];
#[2, 3, 5, 6] => [12, 15]

main_list = [2, 3, 5, 6]
res_list = []
for i in range((len(main_list)+1)//2):
    res_list.append(main_list[i] * main_list[len(main_list)-1-i])
print(res_list)